MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K80/mcu.h
extern volatile RXF2SIDLbits_t RXF2SIDLbits __at(0xEE9);
// bitfield macros
#define _RXF2SIDL_EID_POSN                                  0x0
#define _RXF2SIDL_EID_POSITION                              0x0
#define _RXF2SIDL_EID_SIZE                                  0x2
#define _RXF2SIDL_EID_LENGTH                                0x2
#define _RXF2SIDL_EID_MASK                                  0x3
#define _RXF2SIDL_EXIDEN_POSN                               0x3
#define _RXF2SIDL_EXIDEN_POSITION                           0x3
#define _RXF2SIDL_EXIDEN_SIZE                               0x1
#define _RXF2SIDL_EXIDEN_LENGTH                             0x1
#define _RXF2SIDL_EXIDEN_MASK                               0x8
#define _RXF2SIDL_SID_POSN                                  0x5
#define _RXF2SIDL_SID_POSITION                              0x5
#define _RXF2SIDL_SID_SIZE                                  0x3
#define _RXF2SIDL_SID_LENGTH                                0x3
#define _RXF2SIDL_SID_MASK                                  0xE0
#define _RXF2SIDL_EID16_POSN                                0x0
#define _RXF2SIDL_EID16_POSITION                            0x0
#define _RXF2SIDL_EID16_SIZE                                0x1
#define _RXF2SIDL_EID16_LENGTH                              0x1
#define _RXF2SIDL_EID16_MASK                                0x1
#define _RXF2SIDL_EID17_POSN                                0x1
#define _RXF2SIDL_EID17_POSITION                            0x1
#define _RXF2SIDL_EID17_SIZE                                0x1
#define _RXF2SIDL_EID17_LENGTH                              0x1
#define _RXF2SIDL_EID17_MASK                                0x2
#define _RXF2SIDL_SID0_POSN                                 0x5
#define _RXF2SIDL_SID0_POSITION                             0x5
#define _RXF2SIDL_SID0_SIZE                                 0x1
#define _RXF2SIDL_SID0_LENGTH                               0x1
#define _RXF2SIDL_SID0_MASK                                 0x20
#define _RXF2SIDL_SID1_POSN                                 0x6
#define _RXF2SIDL_SID1_POSITION                             0x6
#define _RXF2SIDL_SID1_SIZE                                 0x1
#define _RXF2SIDL_SID1_LENGTH                               0x1
#define _RXF2SIDL_SID1_MASK                                 0x40
#define _RXF2SIDL_SID2_POSN                                 0x7
#define _RXF2SIDL_SID2_POSITION                             0x7
#define _RXF2SIDL_SID2_SIZE                                 0x1
#define _RXF2SIDL_SID2_LENGTH                               0x1
#define _RXF2SIDL_SID2_MASK                                 0x80
#define _RXF2SIDL_RXF2EID16_POSN                            0x0
#define _RXF2SIDL_RXF2EID16_POSITION                        0x0
#define _RXF2SIDL_RXF2EID16_SIZE                            0x1
#define _RXF2SIDL_RXF2EID16_LENGTH                          0x1
#define _RXF2SIDL_RXF2EID16_MASK                            0x1
#define _RXF2SIDL_RXF2EID17_POSN                            0x1
#define _RXF2SIDL_RXF2EID17_POSITION                        0x1
#define _RXF2SIDL_RXF2EID17_SIZE                            0x1
#define _RXF2SIDL_RXF2EID17_LENGTH                          0x1
#define _RXF2SIDL_RXF2EID17_MASK                            0x2
#define _RXF2SIDL_RXF2EXIDEN_POSN                           0x3
#define _RXF2SIDL_RXF2EXIDEN_POSITION                       0x3
#define _RXF2SIDL_RXF2EXIDEN_SIZE                           0x1
#define _RXF2SIDL_RXF2EXIDEN_LENGTH                         0x1
#define _RXF2SIDL_RXF2EXIDEN_MASK                           0x8
#define _RXF2SIDL_RXF2SID0_POSN                             0x5
#define _RXF2SIDL_RXF2SID0_POSITION                         0x5
#define _RXF2SIDL_RXF2SID0_SIZE                             0x1
#define _RXF2SIDL_RXF2SID0_LENGTH                           0x1
#define _RXF2SIDL_RXF2SID0_MASK                             0x20
#define _RXF2SIDL_RXF2SID1_POSN                             0x6
#define _RXF2SIDL_RXF2SID1_POSITION                         0x6
#define _RXF2SIDL_RXF2SID1_SIZE                             0x1
#define _RXF2SIDL_RXF2SID1_LENGTH                           0x1
#define _RXF2SIDL_RXF2SID1_MASK                             0x40
#define _RXF2SIDL_RXF2SID2_POSN                             0x7
#define _RXF2SIDL_RXF2SID2_POSITION                         0x7
#define _RXF2SIDL_RXF2SID2_SIZE                             0x1
#define _RXF2SIDL_RXF2SID2_LENGTH                           0x1
#define _RXF2SIDL_RXF2SID2_MASK                             0x80

// Register: RXF2EIDH
#define RXF2EIDH RXF2EIDH
extern volatile unsigned char           RXF2EIDH            __at(0xEEA);
#ifndef _LIB_BUILD
asm("RXF2EIDH equ 0EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF2EID8               :1;
        unsigned RXF2EID9               :1;
        unsigned RXF2EID10              :1;
        unsigned RXF2EID11              :1;
        unsigned RXF2EID12              :1;
        unsigned RXF2EID13              :1;
        unsigned RXF2EID14              :1;
        unsigned RXF2EID15              :1;
    };
} RXF2EIDHbits_t;
extern volatile RXF2EIDHbits_t RXF2EIDHbits __at(0xEEA);
// bitfield macros
#define _RXF2EIDH_EID_POSN                                  0x0
#define _RXF2EIDH_EID_POSITION                              0x0
#define _RXF2EIDH_EID_SIZE                                  0x8
#define _RXF2EIDH_EID_LENGTH                                0x8
#define _RXF2EIDH_EID_MASK                                  0xFF
#define _RXF2EIDH_EID8_POSN                                 0x0
#define _RXF2EIDH_EID8_POSITION                             0x0
#define _RXF2EIDH_EID8_SIZE                                 0x1
#define _RXF2EIDH_EID8_LENGTH                               0x1
#define _RXF2EIDH_EID8_MASK                                 0x1
#define _RXF2EIDH_EID9_POSN                                 0x1
#define _RXF2EIDH_EID9_POSITION                             0x1
#define _RXF2EIDH_EID9_SIZE                                 0x1
#define _RXF2EIDH_EID9_LENGTH                               0x1
#define _RXF2EIDH_EID9_MASK                                 0x2
#define _RXF2EIDH_EID10_POSN                                0x2
#define _RXF2EIDH_EID10_POSITION                            0x2
#define _RXF2EIDH_EID10_SIZE                                0x1
#define _RXF2EIDH_EID10_LENGTH                              0x1
#define _RXF2EIDH_EID10_MASK                                0x4
#define _RXF2EIDH_EID11_POSN                                0x3
#define _RXF2EIDH_EID11_POSITION                            0x3
#define _RXF2EIDH_EID11_SIZE                                0x1
#define _RXF2EIDH_EID11_LENGTH                              0x1
#define _RXF2EIDH_EID11_MASK                                0x8
#define _RXF2EIDH_EID12_POSN                                0x4
#define _RXF2EIDH_EID12_POSITION                            0x4
#define _RXF2EIDH_EID12_SIZE                                0x1
#define _RXF2EIDH_EID12_LENGTH                              0x1
#define _RXF2EIDH_EID12_MASK                                0x10
#define _RXF2EIDH_EID13_POSN                                0x5
#define _RXF2EIDH_EID13_POSITION                            0x5
#define _RXF2EIDH_EID13_SIZE                                0x1
#define _RXF2EIDH_EID13_LENGTH                              0x1
#define _RXF2EIDH_EID13_MASK                                0x20
#define _RXF2EIDH_EID14_POSN                                0x6
#define _RXF2EIDH_EID14_POSITION                            0x6
#define _RXF2EIDH_EID14_SIZE                                0x1
#define _RXF2EIDH_EID14_LENGTH                              0x1
#define _RXF2EIDH_EID14_MASK                                0x40
#define _RXF2EIDH_EID15_POSN                                0x7
#define _RXF2EIDH_EID15_POSITION                            0x7
#define _RXF2EIDH_EID15_SIZE                                0x1
#define _RXF2EIDH_EID15_LENGTH                              0x1
#define _RXF2EIDH_EID15_MASK                                0x80
#define _RXF2EIDH_RXF2EID8_POSN                             0x0
#define _RXF2EIDH_RXF2EID8_POSITION                         0x0
#define _RXF2EIDH_RXF2EID8_SIZE                             0x1
#define _RXF2EIDH_RXF2EID8_LENGTH                           0x1
#define _RXF2EIDH_RXF2EID8_MASK                             0x1
#define _RXF2EIDH_RXF2EID9_POSN                             0x1
#define _RXF2EIDH_RXF2EID9_POSITION                         0x1
#define _RXF2EIDH_RXF2EID9_SIZE                             0x1
#define _RXF2EIDH_RXF2EID9_LENGTH                           0x1
#define _RXF2EIDH_RXF2EID9_MASK                             0x2
#define _RXF2EIDH_RXF2EID10_POSN                            0x2
#define _RXF2EIDH_RXF2EID10_POSITION                        0x2
#define _RXF2EIDH_RXF2EID10_SIZE                            0x1
#define _RXF2EIDH_RXF2EID10_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID10_MASK                            0x4
#define _RXF2EIDH_RXF2EID11_POSN                            0x3
#define _RXF2EIDH_RXF2EID11_POSITION                        0x3
#define _RXF2EIDH_RXF2EID11_SIZE                            0x1
#define _RXF2EIDH_RXF2EID11_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID11_MASK                            0x8
#define _RXF2EIDH_RXF2EID12_POSN                            0x4
#define _RXF2EIDH_RXF2EID12_POSITION                        0x4
#define _RXF2EIDH_RXF2EID12_SIZE                            0x1
#define _RXF2EIDH_RXF2EID12_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID12_MASK                            0x10
#define _RXF2EIDH_RXF2EID13_POSN                            0x5
#define _RXF2EIDH_RXF2EID13_POSITION                        0x5
#define _RXF2EIDH_RXF2EID13_SIZE                            0x1
#define _RXF2EIDH_RXF2EID13_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID13_MASK                            0x20
#define _RXF2EIDH_RXF2EID14_POSN                            0x6
#define _RXF2EIDH_RXF2EID14_POSITION                        0x6
#define _RXF2EIDH_RXF2EID14_SIZE                            0x1
#define _RXF2EIDH_RXF2EID14_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID14_MASK                            0x40
#define _RXF2EIDH_RXF2EID15_POSN                            0x7
#define _RXF2EIDH_RXF2EID15_POSITION                        0x7
#define _RXF2EIDH_RXF2EID15_SIZE                            0x1
#define _RXF2EIDH_RXF2EID15_LENGTH                          0x1
#define _RXF2EIDH_RXF2EID15_MASK                            0x80

// Register: RXF2EIDL
#define RXF2EIDL RXF2EIDL
extern volatile unsigned char           RXF2EIDL            __at(0xEEB);
#ifndef _LIB_BUILD
asm("RXF2EIDL equ 0EEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF2EID0               :1;
        unsigned RXF2EID1               :1;
        unsigned RXF2EID2               :1;
        unsigned RXF2EID3               :1;
        unsigned RXF2EID4               :1;
        unsigned RXF2EID5               :1;
        unsigned RXF2EID6               :1;
        unsigned RXF2EID7               :1;
    };
} RXF2EIDLbits_t;
extern volatile RXF2EIDLbits_t RXF2EIDLbits __at(0xEEB);
// bitfield macros
#define _RXF2EIDL_EID_POSN                                  0x0
#define _RXF2EIDL_EID_POSITION                              0x0
#define _RXF2EIDL_EID_SIZE                                  0x8
#define _RXF2EIDL_EID_LENGTH                                0x8
#define _RXF2EIDL_EID_MASK                                  0xFF
#define _RXF2EIDL_EID0_POSN                                 0x0
#define _RXF2EIDL_EID0_POSITION                             0x0
#define _RXF2EIDL_EID0_SIZE                                 0x1
#define _RXF2EIDL_EID0_LENGTH                               0x1
#define _RXF2EIDL_EID0_MASK                                 0x1
#define _RXF2EIDL_EID1_POSN                                 0x1
#define _RXF2EIDL_EID1_POSITION                             0x1
#define _RXF2EIDL_EID1_SIZE                                 0x1
#define _RXF2EIDL_EID1_LENGTH                               0x1
#define _RXF2EIDL_EID1_MASK                                 0x2
#define _RXF2EIDL_EID2_POSN                                 0x2
#define _RXF2EIDL_EID2_POSITION                             0x2
#define _RXF2EIDL_EID2_SIZE                                 0x1
#define _RXF2EIDL_EID2_LENGTH                               0x1
#define _RXF2EIDL_EID2_MASK                                 0x4
#define _RXF2EIDL_EID3_POSN                                 0x3
#define _RXF2EIDL_EID3_POSITION                             0x3
#define _RXF2EIDL_EID3_SIZE                                 0x1
#define _RXF2EIDL_EID3_LENGTH                               0x1
#define _RXF2EIDL_EID3_MASK                                 0x8
#define _RXF2EIDL_EID4_POSN                                 0x4
#define _RXF2EIDL_EID4_POSITION                             0x4
#define _RXF2EIDL_EID4_SIZE                                 0x1
#define _RXF2EIDL_EID4_LENGTH                               0x1
#define _RXF2EIDL_EID4_MASK                                 0x10
#define _RXF2EIDL_EID5_POSN                                 0x5
#define _RXF2EIDL_EID5_POSITION                             0x5
#define _RXF2EIDL_EID5_SIZE                                 0x1
#define _RXF2EIDL_EID5_LENGTH                               0x1
#define _RXF2EIDL_EID5_MASK                                 0x20
#define _RXF2EIDL_EID6_POSN                                 0x6
#define _RXF2EIDL_EID6_POSITION                             0x6
#define _RXF2EIDL_EID6_SIZE                                 0x1
#define _RXF2EIDL_EID6_LENGTH                               0x1
#define _RXF2EIDL_EID6_MASK                                 0x40
#define _RXF2EIDL_EID7_POSN                                 0x7
#define _RXF2EIDL_EID7_POSITION                             0x7
#define _RXF2EIDL_EID7_SIZE                                 0x1
#define _RXF2EIDL_EID7_LENGTH                               0x1
#define _RXF2EIDL_EID7_MASK                                 0x80
#define _RXF2EIDL_RXF2EID0_POSN                             0x0
#define _RXF2EIDL_RXF2EID0_POSITION                         0x0
#define _RXF2EIDL_RXF2EID0_SIZE                             0x1
#define _RXF2EIDL_RXF2EID0_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID0_MASK                             0x1
#define _RXF2EIDL_RXF2EID1_POSN                             0x1
#define _RXF2EIDL_RXF2EID1_POSITION                         0x1
#define _RXF2EIDL_RXF2EID1_SIZE                             0x1
#define _RXF2EIDL_RXF2EID1_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID1_MASK                             0x2
#define _RXF2EIDL_RXF2EID2_POSN                             0x2
#define _RXF2EIDL_RXF2EID2_POSITION                         0x2
#define _RXF2EIDL_RXF2EID2_SIZE                             0x1
#define _RXF2EIDL_RXF2EID2_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID2_MASK                             0x4
#define _RXF2EIDL_RXF2EID3_POSN                             0x3
#define _RXF2EIDL_RXF2EID3_POSITION                         0x3
#define _RXF2EIDL_RXF2EID3_SIZE                             0x1
#define _RXF2EIDL_RXF2EID3_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID3_MASK                             0x8
#define _RXF2EIDL_RXF2EID4_POSN                             0x4
#define _RXF2EIDL_RXF2EID4_POSITION                         0x4
#define _RXF2EIDL_RXF2EID4_SIZE                             0x1
#define _RXF2EIDL_RXF2EID4_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID4_MASK                             0x10
#define _RXF2EIDL_RXF2EID5_POSN                             0x5
#define _RXF2EIDL_RXF2EID5_POSITION                         0x5
#define _RXF2EIDL_RXF2EID5_SIZE                             0x1
#define _RXF2EIDL_RXF2EID5_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID5_MASK                             0x20
#define _RXF2EIDL_RXF2EID6_POSN                             0x6
#define _RXF2EIDL_RXF2EID6_POSITION                         0x6
#define _RXF2EIDL_RXF2EID6_SIZE                             0x1
#define _RXF2EIDL_RXF2EID6_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID6_MASK                             0x40
#define _RXF2EIDL_RXF2EID7_POSN                             0x7
#define _RXF2EIDL_RXF2EID7_POSITION                         0x7
#define _RXF2EIDL_RXF2EID7_SIZE                             0x1
#define _RXF2EIDL_RXF2EID7_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID7_MASK                             0x80

