MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K80/mcu.h
// Register: RXB1DLC
#define RXB1DLC RXB1DLC
extern volatile unsigned char           RXB1DLC             __at(0xF35);
#ifndef _LIB_BUILD
asm("RXB1DLC equ 0F35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
    };
    struct {
        unsigned RXB1DLC0               :1;
        unsigned RXB1DLC1               :1;
        unsigned RXB1DLC2               :1;
        unsigned RXB1DLC3               :1;
        unsigned RXB1RB0                :1;
        unsigned RXB1RB1                :1;
        unsigned RXB1RTR                :1;
    };
} RXB1DLCbits_t;
extern volatile RXB1DLCbits_t RXB1DLCbits __at(0xF35);
// bitfield macros
#define _RXB1DLC_DLC_POSN                                   0x0
#define _RXB1DLC_DLC_POSITION                               0x0
#define _RXB1DLC_DLC_SIZE                                   0x4
#define _RXB1DLC_DLC_LENGTH                                 0x4
#define _RXB1DLC_DLC_MASK                                   0xF
#define _RXB1DLC_RB_POSN                                    0x4
#define _RXB1DLC_RB_POSITION                                0x4
#define _RXB1DLC_RB_SIZE                                    0x2
#define _RXB1DLC_RB_LENGTH                                  0x2
#define _RXB1DLC_RB_MASK                                    0x30
#define _RXB1DLC_RXRTR_POSN                                 0x6
#define _RXB1DLC_RXRTR_POSITION                             0x6
#define _RXB1DLC_RXRTR_SIZE                                 0x1
#define _RXB1DLC_RXRTR_LENGTH                               0x1
#define _RXB1DLC_RXRTR_MASK                                 0x40
#define _RXB1DLC_DLC0_POSN                                  0x0
#define _RXB1DLC_DLC0_POSITION                              0x0
#define _RXB1DLC_DLC0_SIZE                                  0x1
#define _RXB1DLC_DLC0_LENGTH                                0x1
#define _RXB1DLC_DLC0_MASK                                  0x1
#define _RXB1DLC_DLC1_POSN                                  0x1
#define _RXB1DLC_DLC1_POSITION                              0x1
#define _RXB1DLC_DLC1_SIZE                                  0x1
#define _RXB1DLC_DLC1_LENGTH                                0x1
#define _RXB1DLC_DLC1_MASK                                  0x2
#define _RXB1DLC_DLC2_POSN                                  0x2
#define _RXB1DLC_DLC2_POSITION                              0x2
#define _RXB1DLC_DLC2_SIZE                                  0x1
#define _RXB1DLC_DLC2_LENGTH                                0x1
#define _RXB1DLC_DLC2_MASK                                  0x4
#define _RXB1DLC_DLC3_POSN                                  0x3
#define _RXB1DLC_DLC3_POSITION                              0x3
#define _RXB1DLC_DLC3_SIZE                                  0x1
#define _RXB1DLC_DLC3_LENGTH                                0x1
#define _RXB1DLC_DLC3_MASK                                  0x8
#define _RXB1DLC_RB0_POSN                                   0x4
#define _RXB1DLC_RB0_POSITION                               0x4
#define _RXB1DLC_RB0_SIZE                                   0x1
#define _RXB1DLC_RB0_LENGTH                                 0x1
#define _RXB1DLC_RB0_MASK                                   0x10
#define _RXB1DLC_RB1_POSN                                   0x5
#define _RXB1DLC_RB1_POSITION                               0x5
#define _RXB1DLC_RB1_SIZE                                   0x1
#define _RXB1DLC_RB1_LENGTH                                 0x1
#define _RXB1DLC_RB1_MASK                                   0x20
#define _RXB1DLC_RXB1DLC0_POSN                              0x0
#define _RXB1DLC_RXB1DLC0_POSITION                          0x0
#define _RXB1DLC_RXB1DLC0_SIZE                              0x1
#define _RXB1DLC_RXB1DLC0_LENGTH                            0x1
#define _RXB1DLC_RXB1DLC0_MASK                              0x1
#define _RXB1DLC_RXB1DLC1_POSN                              0x1
#define _RXB1DLC_RXB1DLC1_POSITION                          0x1
#define _RXB1DLC_RXB1DLC1_SIZE                              0x1
#define _RXB1DLC_RXB1DLC1_LENGTH                            0x1
#define _RXB1DLC_RXB1DLC1_MASK                              0x2
#define _RXB1DLC_RXB1DLC2_POSN                              0x2
#define _RXB1DLC_RXB1DLC2_POSITION                          0x2
#define _RXB1DLC_RXB1DLC2_SIZE                              0x1
#define _RXB1DLC_RXB1DLC2_LENGTH                            0x1
#define _RXB1DLC_RXB1DLC2_MASK                              0x4
#define _RXB1DLC_RXB1DLC3_POSN                              0x3
#define _RXB1DLC_RXB1DLC3_POSITION                          0x3
#define _RXB1DLC_RXB1DLC3_SIZE                              0x1
#define _RXB1DLC_RXB1DLC3_LENGTH                            0x1
#define _RXB1DLC_RXB1DLC3_MASK                              0x8
#define _RXB1DLC_RXB1RB0_POSN                               0x4
#define _RXB1DLC_RXB1RB0_POSITION                           0x4
#define _RXB1DLC_RXB1RB0_SIZE                               0x1
#define _RXB1DLC_RXB1RB0_LENGTH                             0x1
#define _RXB1DLC_RXB1RB0_MASK                               0x10
#define _RXB1DLC_RXB1RB1_POSN                               0x5
#define _RXB1DLC_RXB1RB1_POSITION                           0x5
#define _RXB1DLC_RXB1RB1_SIZE                               0x1
#define _RXB1DLC_RXB1RB1_LENGTH                             0x1
#define _RXB1DLC_RXB1RB1_MASK                               0x20
#define _RXB1DLC_RXB1RTR_POSN                               0x6
#define _RXB1DLC_RXB1RTR_POSITION                           0x6
#define _RXB1DLC_RXB1RTR_SIZE                               0x1
#define _RXB1DLC_RXB1RTR_LENGTH                             0x1
#define _RXB1DLC_RXB1RTR_MASK                               0x40

// Register: RXB1D0
#define RXB1D0 RXB1D0
extern volatile unsigned char           RXB1D0              __at(0xF36);
#ifndef _LIB_BUILD
asm("RXB1D0 equ 0F36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D0                 :8;
    };
    struct {
        unsigned RXB1D00                :1;
        unsigned RXB1D01                :1;
        unsigned RXB1D02                :1;
        unsigned RXB1D03                :1;
        unsigned RXB1D04                :1;
        unsigned RXB1D05                :1;
        unsigned RXB1D06                :1;
        unsigned RXB1D07                :1;
    };
} RXB1D0bits_t;
extern volatile RXB1D0bits_t RXB1D0bits __at(0xF36);
// bitfield macros
#define _RXB1D0_RXB1D0_POSN                                 0x0
#define _RXB1D0_RXB1D0_POSITION                             0x0
#define _RXB1D0_RXB1D0_SIZE                                 0x8
#define _RXB1D0_RXB1D0_LENGTH                               0x8
#define _RXB1D0_RXB1D0_MASK                                 0xFF
#define _RXB1D0_RXB1D00_POSN                                0x0
#define _RXB1D0_RXB1D00_POSITION                            0x0
#define _RXB1D0_RXB1D00_SIZE                                0x1
#define _RXB1D0_RXB1D00_LENGTH                              0x1
#define _RXB1D0_RXB1D00_MASK                                0x1
#define _RXB1D0_RXB1D01_POSN                                0x1
#define _RXB1D0_RXB1D01_POSITION                            0x1
#define _RXB1D0_RXB1D01_SIZE                                0x1
#define _RXB1D0_RXB1D01_LENGTH                              0x1
#define _RXB1D0_RXB1D01_MASK                                0x2
#define _RXB1D0_RXB1D02_POSN                                0x2
#define _RXB1D0_RXB1D02_POSITION                            0x2
#define _RXB1D0_RXB1D02_SIZE                                0x1
#define _RXB1D0_RXB1D02_LENGTH                              0x1
#define _RXB1D0_RXB1D02_MASK                                0x4
#define _RXB1D0_RXB1D03_POSN                                0x3
#define _RXB1D0_RXB1D03_POSITION                            0x3
#define _RXB1D0_RXB1D03_SIZE                                0x1
#define _RXB1D0_RXB1D03_LENGTH                              0x1
#define _RXB1D0_RXB1D03_MASK                                0x8
#define _RXB1D0_RXB1D04_POSN                                0x4
#define _RXB1D0_RXB1D04_POSITION                            0x4
#define _RXB1D0_RXB1D04_SIZE                                0x1
#define _RXB1D0_RXB1D04_LENGTH                              0x1
#define _RXB1D0_RXB1D04_MASK                                0x10
#define _RXB1D0_RXB1D05_POSN                                0x5
#define _RXB1D0_RXB1D05_POSITION                            0x5
#define _RXB1D0_RXB1D05_SIZE                                0x1
#define _RXB1D0_RXB1D05_LENGTH                              0x1
#define _RXB1D0_RXB1D05_MASK                                0x20
#define _RXB1D0_RXB1D06_POSN                                0x6
#define _RXB1D0_RXB1D06_POSITION                            0x6
#define _RXB1D0_RXB1D06_SIZE                                0x1
#define _RXB1D0_RXB1D06_LENGTH                              0x1
#define _RXB1D0_RXB1D06_MASK                                0x40
#define _RXB1D0_RXB1D07_POSN                                0x7
#define _RXB1D0_RXB1D07_POSITION                            0x7
#define _RXB1D0_RXB1D07_SIZE                                0x1
#define _RXB1D0_RXB1D07_LENGTH                              0x1
#define _RXB1D0_RXB1D07_MASK                                0x80

