MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K80/mcu.h
#define                                 RXF15EID16_bit      _BIT_ACCESS(RXF15SIDL,0)
// RXF15SIDL<RXF15EID17>
extern volatile __bit                   RXF15EID17          __at(0x7369);	// @ (0xE6D * 8 + 1)
#define                                 RXF15EID17_bit      _BIT_ACCESS(RXF15SIDL,1)
// RXF15EIDL<RXF15EID2>
extern volatile __bit                   RXF15EID2           __at(0x737A);	// @ (0xE6F * 8 + 2)
#define                                 RXF15EID2_bit       _BIT_ACCESS(RXF15EIDL,2)
// RXF15EIDL<RXF15EID3>
extern volatile __bit                   RXF15EID3           __at(0x737B);	// @ (0xE6F * 8 + 3)
#define                                 RXF15EID3_bit       _BIT_ACCESS(RXF15EIDL,3)
// RXF15EIDL<RXF15EID4>
extern volatile __bit                   RXF15EID4           __at(0x737C);	// @ (0xE6F * 8 + 4)
#define                                 RXF15EID4_bit       _BIT_ACCESS(RXF15EIDL,4)
// RXF15EIDL<RXF15EID5>
extern volatile __bit                   RXF15EID5           __at(0x737D);	// @ (0xE6F * 8 + 5)
#define                                 RXF15EID5_bit       _BIT_ACCESS(RXF15EIDL,5)
// RXF15EIDL<RXF15EID6>
extern volatile __bit                   RXF15EID6           __at(0x737E);	// @ (0xE6F * 8 + 6)
#define                                 RXF15EID6_bit       _BIT_ACCESS(RXF15EIDL,6)
// RXF15EIDL<RXF15EID7>
extern volatile __bit                   RXF15EID7           __at(0x737F);	// @ (0xE6F * 8 + 7)
#define                                 RXF15EID7_bit       _BIT_ACCESS(RXF15EIDL,7)
// RXF15EIDH<RXF15EID8>
extern volatile __bit                   RXF15EID8           __at(0x7370);	// @ (0xE6E * 8 + 0)
#define                                 RXF15EID8_bit       _BIT_ACCESS(RXF15EIDH,0)
// RXF15EIDH<RXF15EID9>
extern volatile __bit                   RXF15EID9           __at(0x7371);	// @ (0xE6E * 8 + 1)
#define                                 RXF15EID9_bit       _BIT_ACCESS(RXF15EIDH,1)
// RXFCON1<RXF15EN>
extern volatile __bit                   RXF15EN             __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 RXF15EN_bit         _BIT_ACCESS(RXFCON1,7)
// RXF15SIDL<RXF15EXIDEN>
extern volatile __bit                   RXF15EXIDEN         __at(0x736B);	// @ (0xE6D * 8 + 3)
#define                                 RXF15EXIDEN_bit     _BIT_ACCESS(RXF15SIDL,3)
// RXF15SIDL<RXF15SID0>
extern volatile __bit                   RXF15SID0           __at(0x736D);	// @ (0xE6D * 8 + 5)
#define                                 RXF15SID0_bit       _BIT_ACCESS(RXF15SIDL,5)
// RXF15SIDL<RXF15SID1>
extern volatile __bit                   RXF15SID1           __at(0x736E);	// @ (0xE6D * 8 + 6)
#define                                 RXF15SID1_bit       _BIT_ACCESS(RXF15SIDL,6)
// RXF15SIDH<RXF15SID10>
extern volatile __bit                   RXF15SID10          __at(0x7367);	// @ (0xE6C * 8 + 7)
#define                                 RXF15SID10_bit      _BIT_ACCESS(RXF15SIDH,7)
// RXF15SIDL<RXF15SID2>
extern volatile __bit                   RXF15SID2           __at(0x736F);	// @ (0xE6D * 8 + 7)
#define                                 RXF15SID2_bit       _BIT_ACCESS(RXF15SIDL,7)
// RXF15SIDH<RXF15SID3>
extern volatile __bit                   RXF15SID3           __at(0x7360);	// @ (0xE6C * 8 + 0)
#define                                 RXF15SID3_bit       _BIT_ACCESS(RXF15SIDH,0)
// RXF15SIDH<RXF15SID4>
extern volatile __bit                   RXF15SID4           __at(0x7361);	// @ (0xE6C * 8 + 1)
#define                                 RXF15SID4_bit       _BIT_ACCESS(RXF15SIDH,1)
// RXF15SIDH<RXF15SID5>
extern volatile __bit                   RXF15SID5           __at(0x7362);	// @ (0xE6C * 8 + 2)
#define                                 RXF15SID5_bit       _BIT_ACCESS(RXF15SIDH,2)
// RXF15SIDH<RXF15SID6>
extern volatile __bit                   RXF15SID6           __at(0x7363);	// @ (0xE6C * 8 + 3)
#define                                 RXF15SID6_bit       _BIT_ACCESS(RXF15SIDH,3)
// RXF15SIDH<RXF15SID7>
extern volatile __bit                   RXF15SID7           __at(0x7364);	// @ (0xE6C * 8 + 4)
#define                                 RXF15SID7_bit       _BIT_ACCESS(RXF15SIDH,4)
// RXF15SIDH<RXF15SID8>
extern volatile __bit                   RXF15SID8           __at(0x7365);	// @ (0xE6C * 8 + 5)
#define                                 RXF15SID8_bit       _BIT_ACCESS(RXF15SIDH,5)
// RXF15SIDH<RXF15SID9>
extern volatile __bit                   RXF15SID9           __at(0x7366);	// @ (0xE6C * 8 + 6)
#define                                 RXF15SID9_bit       _BIT_ACCESS(RXF15SIDH,6)
// RXF1EIDL<RXF1EID0>
extern volatile __bit                   RXF1EID0            __at(0x7738);	// @ (0xEE7 * 8 + 0)
#define                                 RXF1EID0_bit        _BIT_ACCESS(RXF1EIDL,0)
// RXF1EIDL<RXF1EID1>
extern volatile __bit                   RXF1EID1            __at(0x7739);	// @ (0xEE7 * 8 + 1)
#define                                 RXF1EID1_bit        _BIT_ACCESS(RXF1EIDL,1)
// RXF1EIDH<RXF1EID10>
extern volatile __bit                   RXF1EID10           __at(0x7732);	// @ (0xEE6 * 8 + 2)
#define                                 RXF1EID10_bit       _BIT_ACCESS(RXF1EIDH,2)
// RXF1EIDH<RXF1EID11>
extern volatile __bit                   RXF1EID11           __at(0x7733);	// @ (0xEE6 * 8 + 3)
#define                                 RXF1EID11_bit       _BIT_ACCESS(RXF1EIDH,3)
// RXF1EIDH<RXF1EID12>
extern volatile __bit                   RXF1EID12           __at(0x7734);	// @ (0xEE6 * 8 + 4)
#define                                 RXF1EID12_bit       _BIT_ACCESS(RXF1EIDH,4)
// RXF1EIDH<RXF1EID13>
extern volatile __bit                   RXF1EID13           __at(0x7735);	// @ (0xEE6 * 8 + 5)
#define                                 RXF1EID13_bit       _BIT_ACCESS(RXF1EIDH,5)
// RXF1EIDH<RXF1EID14>
extern volatile __bit                   RXF1EID14           __at(0x7736);	// @ (0xEE6 * 8 + 6)
#define                                 RXF1EID14_bit       _BIT_ACCESS(RXF1EIDH,6)
// RXF1EIDH<RXF1EID15>
extern volatile __bit                   RXF1EID15           __at(0x7737);	// @ (0xEE6 * 8 + 7)
#define                                 RXF1EID15_bit       _BIT_ACCESS(RXF1EIDH,7)
// RXF1SIDL<RXF1EID16>
extern volatile __bit                   RXF1EID16           __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 RXF1EID16_bit       _BIT_ACCESS(RXF1SIDL,0)
// RXF1SIDL<RXF1EID17>
extern volatile __bit                   RXF1EID17           __at(0x7729);	// @ (0xEE5 * 8 + 1)
#define                                 RXF1EID17_bit       _BIT_ACCESS(RXF1SIDL,1)
// RXF1EIDL<RXF1EID2>
extern volatile __bit                   RXF1EID2            __at(0x773A);	// @ (0xEE7 * 8 + 2)
#define                                 RXF1EID2_bit        _BIT_ACCESS(RXF1EIDL,2)
// RXF1EIDL<RXF1EID3>
extern volatile __bit                   RXF1EID3            __at(0x773B);	// @ (0xEE7 * 8 + 3)
#define                                 RXF1EID3_bit        _BIT_ACCESS(RXF1EIDL,3)
// RXF1EIDL<RXF1EID4>
extern volatile __bit                   RXF1EID4            __at(0x773C);	// @ (0xEE7 * 8 + 4)
#define                                 RXF1EID4_bit        _BIT_ACCESS(RXF1EIDL,4)
// RXF1EIDL<RXF1EID5>
extern volatile __bit                   RXF1EID5            __at(0x773D);	// @ (0xEE7 * 8 + 5)
#define                                 RXF1EID5_bit        _BIT_ACCESS(RXF1EIDL,5)
// RXF1EIDL<RXF1EID6>
extern volatile __bit                   RXF1EID6            __at(0x773E);	// @ (0xEE7 * 8 + 6)
#define                                 RXF1EID6_bit        _BIT_ACCESS(RXF1EIDL,6)
// RXF1EIDL<RXF1EID7>
extern volatile __bit                   RXF1EID7            __at(0x773F);	// @ (0xEE7 * 8 + 7)
#define                                 RXF1EID7_bit        _BIT_ACCESS(RXF1EIDL,7)
// RXF1EIDH<RXF1EID8>
extern volatile __bit                   RXF1EID8            __at(0x7730);	// @ (0xEE6 * 8 + 0)
#define                                 RXF1EID8_bit        _BIT_ACCESS(RXF1EIDH,0)
// RXF1EIDH<RXF1EID9>
extern volatile __bit                   RXF1EID9            __at(0x7731);	// @ (0xEE6 * 8 + 1)
#define                                 RXF1EID9_bit        _BIT_ACCESS(RXF1EIDH,1)
// RXFCON0<RXF1EN>
extern volatile __bit                   RXF1EN              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 RXF1EN_bit          _BIT_ACCESS(RXFCON0,1)
// RXF1SIDL<RXF1EXIDEN>
extern volatile __bit                   RXF1EXIDEN          __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 RXF1EXIDEN_bit      _BIT_ACCESS(RXF1SIDL,3)
// RXF1SIDL<RXF1SID0>
extern volatile __bit                   RXF1SID0            __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 RXF1SID0_bit        _BIT_ACCESS(RXF1SIDL,5)
// RXF1SIDL<RXF1SID1>
extern volatile __bit                   RXF1SID1            __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 RXF1SID1_bit        _BIT_ACCESS(RXF1SIDL,6)
// RXF1SIDH<RXF1SID10>
extern volatile __bit                   RXF1SID10           __at(0x7727);	// @ (0xEE4 * 8 + 7)
#define                                 RXF1SID10_bit       _BIT_ACCESS(RXF1SIDH,7)
// RXF1SIDL<RXF1SID2>
extern volatile __bit                   RXF1SID2            __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 RXF1SID2_bit        _BIT_ACCESS(RXF1SIDL,7)
// RXF1SIDH<RXF1SID3>
extern volatile __bit                   RXF1SID3            __at(0x7720);	// @ (0xEE4 * 8 + 0)
#define                                 RXF1SID3_bit        _BIT_ACCESS(RXF1SIDH,0)
// RXF1SIDH<RXF1SID4>
extern volatile __bit                   RXF1SID4            __at(0x7721);	// @ (0xEE4 * 8 + 1)
#define                                 RXF1SID4_bit        _BIT_ACCESS(RXF1SIDH,1)
// RXF1SIDH<RXF1SID5>
extern volatile __bit                   RXF1SID5            __at(0x7722);	// @ (0xEE4 * 8 + 2)
#define                                 RXF1SID5_bit        _BIT_ACCESS(RXF1SIDH,2)
// RXF1SIDH<RXF1SID6>
extern volatile __bit                   RXF1SID6            __at(0x7723);	// @ (0xEE4 * 8 + 3)
#define                                 RXF1SID6_bit        _BIT_ACCESS(RXF1SIDH,3)
// RXF1SIDH<RXF1SID7>
extern volatile __bit                   RXF1SID7            __at(0x7724);	// @ (0xEE4 * 8 + 4)
#define                                 RXF1SID7_bit        _BIT_ACCESS(RXF1SIDH,4)
// RXF1SIDH<RXF1SID8>
extern volatile __bit                   RXF1SID8            __at(0x7725);	// @ (0xEE4 * 8 + 5)
#define                                 RXF1SID8_bit        _BIT_ACCESS(RXF1SIDH,5)
// RXF1SIDH<RXF1SID9>
extern volatile __bit                   RXF1SID9            __at(0x7726);	// @ (0xEE4 * 8 + 6)
#define                                 RXF1SID9_bit        _BIT_ACCESS(RXF1SIDH,6)
// RXF2EIDL<RXF2EID0>
extern volatile __bit                   RXF2EID0            __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 RXF2EID0_bit        _BIT_ACCESS(RXF2EIDL,0)
// RXF2EIDL<RXF2EID1>
extern volatile __bit                   RXF2EID1            __at(0x7759);	// @ (0xEEB * 8 + 1)
#define                                 RXF2EID1_bit        _BIT_ACCESS(RXF2EIDL,1)
// RXF2EIDH<RXF2EID10>
extern volatile __bit                   RXF2EID10           __at(0x7752);	// @ (0xEEA * 8 + 2)
#define                                 RXF2EID10_bit       _BIT_ACCESS(RXF2EIDH,2)
// RXF2EIDH<RXF2EID11>
extern volatile __bit                   RXF2EID11           __at(0x7753);	// @ (0xEEA * 8 + 3)
#define                                 RXF2EID11_bit       _BIT_ACCESS(RXF2EIDH,3)
// RXF2EIDH<RXF2EID12>
extern volatile __bit                   RXF2EID12           __at(0x7754);	// @ (0xEEA * 8 + 4)
#define                                 RXF2EID12_bit       _BIT_ACCESS(RXF2EIDH,4)
// RXF2EIDH<RXF2EID13>
extern volatile __bit                   RXF2EID13           __at(0x7755);	// @ (0xEEA * 8 + 5)
#define                                 RXF2EID13_bit       _BIT_ACCESS(RXF2EIDH,5)
// RXF2EIDH<RXF2EID14>
extern volatile __bit                   RXF2EID14           __at(0x7756);	// @ (0xEEA * 8 + 6)
#define                                 RXF2EID14_bit       _BIT_ACCESS(RXF2EIDH,6)
// RXF2EIDH<RXF2EID15>
extern volatile __bit                   RXF2EID15           __at(0x7757);	// @ (0xEEA * 8 + 7)
#define                                 RXF2EID15_bit       _BIT_ACCESS(RXF2EIDH,7)
// RXF2SIDL<RXF2EID16>
extern volatile __bit                   RXF2EID16           __at(0x7748);	// @ (0xEE9 * 8 + 0)
#define                                 RXF2EID16_bit       _BIT_ACCESS(RXF2SIDL,0)
// RXF2SIDL<RXF2EID17>
extern volatile __bit                   RXF2EID17           __at(0x7749);	// @ (0xEE9 * 8 + 1)
#define                                 RXF2EID17_bit       _BIT_ACCESS(RXF2SIDL,1)
// RXF2EIDL<RXF2EID2>
extern volatile __bit                   RXF2EID2            __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 RXF2EID2_bit        _BIT_ACCESS(RXF2EIDL,2)
// RXF2EIDL<RXF2EID3>
extern volatile __bit                   RXF2EID3            __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 RXF2EID3_bit        _BIT_ACCESS(RXF2EIDL,3)
// RXF2EIDL<RXF2EID4>
extern volatile __bit                   RXF2EID4            __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 RXF2EID4_bit        _BIT_ACCESS(RXF2EIDL,4)
// RXF2EIDL<RXF2EID5>
extern volatile __bit                   RXF2EID5            __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 RXF2EID5_bit        _BIT_ACCESS(RXF2EIDL,5)
// RXF2EIDL<RXF2EID6>
extern volatile __bit                   RXF2EID6            __at(0x775E);	// @ (0xEEB * 8 + 6)
#define                                 RXF2EID6_bit        _BIT_ACCESS(RXF2EIDL,6)
// RXF2EIDL<RXF2EID7>
extern volatile __bit                   RXF2EID7            __at(0x775F);	// @ (0xEEB * 8 + 7)
#define                                 RXF2EID7_bit        _BIT_ACCESS(RXF2EIDL,7)
// RXF2EIDH<RXF2EID8>
extern volatile __bit                   RXF2EID8            __at(0x7750);	// @ (0xEEA * 8 + 0)
#define                                 RXF2EID8_bit        _BIT_ACCESS(RXF2EIDH,0)
// RXF2EIDH<RXF2EID9>
extern volatile __bit                   RXF2EID9            __at(0x7751);	// @ (0xEEA * 8 + 1)
#define                                 RXF2EID9_bit        _BIT_ACCESS(RXF2EIDH,1)
// RXFCON0<RXF2EN>
extern volatile __bit                   RXF2EN              __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 RXF2EN_bit          _BIT_ACCESS(RXFCON0,2)
// RXF2SIDL<RXF2EXIDEN>
extern volatile __bit                   RXF2EXIDEN          __at(0x774B);	// @ (0xEE9 * 8 + 3)
#define                                 RXF2EXIDEN_bit      _BIT_ACCESS(RXF2SIDL,3)
// RXF2SIDL<RXF2SID0>
extern volatile __bit                   RXF2SID0            __at(0x774D);	// @ (0xEE9 * 8 + 5)
#define                                 RXF2SID0_bit        _BIT_ACCESS(RXF2SIDL,5)
// RXF2SIDL<RXF2SID1>
extern volatile __bit                   RXF2SID1            __at(0x774E);	// @ (0xEE9 * 8 + 6)
#define                                 RXF2SID1_bit        _BIT_ACCESS(RXF2SIDL,6)
// RXF2SIDH<RXF2SID10>
extern volatile __bit                   RXF2SID10           __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 RXF2SID10_bit       _BIT_ACCESS(RXF2SIDH,7)
// RXF2SIDL<RXF2SID2>
extern volatile __bit                   RXF2SID2            __at(0x774F);	// @ (0xEE9 * 8 + 7)
#define                                 RXF2SID2_bit        _BIT_ACCESS(RXF2SIDL,7)
// RXF2SIDH<RXF2SID3>
extern volatile __bit                   RXF2SID3            __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 RXF2SID3_bit        _BIT_ACCESS(RXF2SIDH,0)
// RXF2SIDH<RXF2SID4>
extern volatile __bit                   RXF2SID4            __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 RXF2SID4_bit        _BIT_ACCESS(RXF2SIDH,1)
// RXF2SIDH<RXF2SID5>
extern volatile __bit                   RXF2SID5            __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 RXF2SID5_bit        _BIT_ACCESS(RXF2SIDH,2)
// RXF2SIDH<RXF2SID6>
extern volatile __bit                   RXF2SID6            __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 RXF2SID6_bit        _BIT_ACCESS(RXF2SIDH,3)
// RXF2SIDH<RXF2SID7>
extern volatile __bit                   RXF2SID7            __at(0x7744);	// @ (0xEE8 * 8 + 4)
#define                                 RXF2SID7_bit        _BIT_ACCESS(RXF2SIDH,4)
// RXF2SIDH<RXF2SID8>
extern volatile __bit                   RXF2SID8            __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 RXF2SID8_bit        _BIT_ACCESS(RXF2SIDH,5)
// RXF2SIDH<RXF2SID9>
extern volatile __bit                   RXF2SID9            __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 RXF2SID9_bit        _BIT_ACCESS(RXF2SIDH,6)
// RXF3EIDL<RXF3EID0>
extern volatile __bit                   RXF3EID0            __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 RXF3EID0_bit        _BIT_ACCESS(RXF3EIDL,0)
// RXF3EIDL<RXF3EID1>
extern volatile __bit                   RXF3EID1            __at(0x7779);	// @ (0xEEF * 8 + 1)
#define                                 RXF3EID1_bit        _BIT_ACCESS(RXF3EIDL,1)
// RXF3EIDH<RXF3EID10>
extern volatile __bit                   RXF3EID10           __at(0x7772);	// @ (0xEEE * 8 + 2)
#define                                 RXF3EID10_bit       _BIT_ACCESS(RXF3EIDH,2)
// RXF3EIDH<RXF3EID11>
extern volatile __bit                   RXF3EID11           __at(0x7773);	// @ (0xEEE * 8 + 3)
#define                                 RXF3EID11_bit       _BIT_ACCESS(RXF3EIDH,3)
// RXF3EIDH<RXF3EID12>
extern volatile __bit                   RXF3EID12           __at(0x7774);	// @ (0xEEE * 8 + 4)
#define                                 RXF3EID12_bit       _BIT_ACCESS(RXF3EIDH,4)
// RXF3EIDH<RXF3EID13>
extern volatile __bit                   RXF3EID13           __at(0x7775);	// @ (0xEEE * 8 + 5)
#define                                 RXF3EID13_bit       _BIT_ACCESS(RXF3EIDH,5)
// RXF3EIDH<RXF3EID14>
extern volatile __bit                   RXF3EID14           __at(0x7776);	// @ (0xEEE * 8 + 6)
#define                                 RXF3EID14_bit       _BIT_ACCESS(RXF3EIDH,6)
// RXF3EIDH<RXF3EID15>
extern volatile __bit                   RXF3EID15           __at(0x7777);	// @ (0xEEE * 8 + 7)
#define                                 RXF3EID15_bit       _BIT_ACCESS(RXF3EIDH,7)
// RXF3SIDL<RXF3EID16>
extern volatile __bit                   RXF3EID16           __at(0x7768);	// @ (0xEED * 8 + 0)
#define                                 RXF3EID16_bit       _BIT_ACCESS(RXF3SIDL,0)
// RXF3SIDL<RXF3EID17>
extern volatile __bit                   RXF3EID17           __at(0x7769);	// @ (0xEED * 8 + 1)
#define                                 RXF3EID17_bit       _BIT_ACCESS(RXF3SIDL,1)
// RXF3EIDL<RXF3EID2>
extern volatile __bit                   RXF3EID2            __at(0x777A);	// @ (0xEEF * 8 + 2)
#define                                 RXF3EID2_bit        _BIT_ACCESS(RXF3EIDL,2)
// RXF3EIDL<RXF3EID3>
extern volatile __bit                   RXF3EID3            __at(0x777B);	// @ (0xEEF * 8 + 3)
#define                                 RXF3EID3_bit        _BIT_ACCESS(RXF3EIDL,3)
// RXF3EIDL<RXF3EID4>
extern volatile __bit                   RXF3EID4            __at(0x777C);	// @ (0xEEF * 8 + 4)
#define                                 RXF3EID4_bit        _BIT_ACCESS(RXF3EIDL,4)
// RXF3EIDL<RXF3EID5>
extern volatile __bit                   RXF3EID5            __at(0x777D);	// @ (0xEEF * 8 + 5)
#define                                 RXF3EID5_bit        _BIT_ACCESS(RXF3EIDL,5)
// RXF3EIDL<RXF3EID6>
extern volatile __bit                   RXF3EID6            __at(0x777E);	// @ (0xEEF * 8 + 6)
#define                                 RXF3EID6_bit        _BIT_ACCESS(RXF3EIDL,6)
// RXF3EIDL<RXF3EID7>
extern volatile __bit                   RXF3EID7            __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 RXF3EID7_bit        _BIT_ACCESS(RXF3EIDL,7)
// RXF3EIDH<RXF3EID8>
extern volatile __bit                   RXF3EID8            __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 RXF3EID8_bit        _BIT_ACCESS(RXF3EIDH,0)
// RXF3EIDH<RXF3EID9>
extern volatile __bit                   RXF3EID9            __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 RXF3EID9_bit        _BIT_ACCESS(RXF3EIDH,1)
// RXFCON0<RXF3EN>
extern volatile __bit                   RXF3EN              __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 RXF3EN_bit          _BIT_ACCESS(RXFCON0,3)
// RXF3SIDL<RXF3EXIDEN>
extern volatile __bit                   RXF3EXIDEN          __at(0x776B);	// @ (0xEED * 8 + 3)
#define                                 RXF3EXIDEN_bit      _BIT_ACCESS(RXF3SIDL,3)
// RXF3SIDL<RXF3SID0>
extern volatile __bit                   RXF3SID0            __at(0x776D);	// @ (0xEED * 8 + 5)
#define                                 RXF3SID0_bit        _BIT_ACCESS(RXF3SIDL,5)
// RXF3SIDL<RXF3SID1>
extern volatile __bit                   RXF3SID1            __at(0x776E);	// @ (0xEED * 8 + 6)
#define                                 RXF3SID1_bit        _BIT_ACCESS(RXF3SIDL,6)
// RXF3SIDH<RXF3SID10>
extern volatile __bit                   RXF3SID10           __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 RXF3SID10_bit       _BIT_ACCESS(RXF3SIDH,7)
// RXF3SIDL<RXF3SID2>
extern volatile __bit                   RXF3SID2            __at(0x776F);	// @ (0xEED * 8 + 7)
#define                                 RXF3SID2_bit        _BIT_ACCESS(RXF3SIDL,7)
// RXF3SIDH<RXF3SID3>
extern volatile __bit                   RXF3SID3            __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 RXF3SID3_bit        _BIT_ACCESS(RXF3SIDH,0)
// RXF3SIDH<RXF3SID4>
extern volatile __bit                   RXF3SID4            __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 RXF3SID4_bit        _BIT_ACCESS(RXF3SIDH,1)
// RXF3SIDH<RXF3SID5>
extern volatile __bit                   RXF3SID5            __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 RXF3SID5_bit        _BIT_ACCESS(RXF3SIDH,2)
// RXF3SIDH<RXF3SID6>
extern volatile __bit                   RXF3SID6            __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 RXF3SID6_bit        _BIT_ACCESS(RXF3SIDH,3)
// RXF3SIDH<RXF3SID7>
extern volatile __bit                   RXF3SID7            __at(0x7764);	// @ (0xEEC * 8 + 4)
#define                                 RXF3SID7_bit        _BIT_ACCESS(RXF3SIDH,4)
// RXF3SIDH<RXF3SID8>
extern volatile __bit                   RXF3SID8            __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 RXF3SID8_bit        _BIT_ACCESS(RXF3SIDH,5)
// RXF3SIDH<RXF3SID9>
extern volatile __bit                   RXF3SID9            __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 RXF3SID9_bit        _BIT_ACCESS(RXF3SIDH,6)
// RXF4EIDL<RXF4EID0>
extern volatile __bit                   RXF4EID0            __at(0x7798);	// @ (0xEF3 * 8 + 0)
#define                                 RXF4EID0_bit        _BIT_ACCESS(RXF4EIDL,0)
// RXF4EIDL<RXF4EID1>
extern volatile __bit                   RXF4EID1            __at(0x7799);	// @ (0xEF3 * 8 + 1)
#define                                 RXF4EID1_bit        _BIT_ACCESS(RXF4EIDL,1)
// RXF4EIDH<RXF4EID10>
extern volatile __bit                   RXF4EID10           __at(0x7792);	// @ (0xEF2 * 8 + 2)
#define                                 RXF4EID10_bit       _BIT_ACCESS(RXF4EIDH,2)
// RXF4EIDH<RXF4EID11>
