MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K80/mcu.h
extern volatile __bit                   TX92                __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 TX92_bit            _BIT_ACCESS(TXSTA2,6)
// TXSTA1<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TX9D2>
extern volatile __bit                   TX9D2               __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 TX9D2_bit           _BIT_ACCESS(TXSTA2,0)
// TXB0CON<TXB0ABT>
extern volatile __bit                   TXB0ABT             __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 TXB0ABT_bit         _BIT_ACCESS(TXB0CON,6)
// TXB0D0<TXB0D00>
extern volatile __bit                   TXB0D00             __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 TXB0D00_bit         _BIT_ACCESS(TXB0D0,0)
// TXB0D0<TXB0D01>
extern volatile __bit                   TXB0D01             __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 TXB0D01_bit         _BIT_ACCESS(TXB0D0,1)
// TXB0D0<TXB0D02>
extern volatile __bit                   TXB0D02             __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 TXB0D02_bit         _BIT_ACCESS(TXB0D0,2)
// TXB0D0<TXB0D03>
extern volatile __bit                   TXB0D03             __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 TXB0D03_bit         _BIT_ACCESS(TXB0D0,3)
// TXB0D0<TXB0D04>
extern volatile __bit                   TXB0D04             __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 TXB0D04_bit         _BIT_ACCESS(TXB0D0,4)
// TXB0D0<TXB0D05>
extern volatile __bit                   TXB0D05             __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 TXB0D05_bit         _BIT_ACCESS(TXB0D0,5)
// TXB0D0<TXB0D06>
extern volatile __bit                   TXB0D06             __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 TXB0D06_bit         _BIT_ACCESS(TXB0D0,6)
// TXB0D0<TXB0D07>
extern volatile __bit                   TXB0D07             __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 TXB0D07_bit         _BIT_ACCESS(TXB0D0,7)
// TXB0D1<TXB0D10>
extern volatile __bit                   TXB0D10             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 TXB0D10_bit         _BIT_ACCESS(TXB0D1,0)
// TXB0D1<TXB0D11>
extern volatile __bit                   TXB0D11             __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 TXB0D11_bit         _BIT_ACCESS(TXB0D1,1)
// TXB0D1<TXB0D12>
extern volatile __bit                   TXB0D12             __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 TXB0D12_bit         _BIT_ACCESS(TXB0D1,2)
// TXB0D1<TXB0D13>
extern volatile __bit                   TXB0D13             __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 TXB0D13_bit         _BIT_ACCESS(TXB0D1,3)
// TXB0D1<TXB0D14>
extern volatile __bit                   TXB0D14             __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 TXB0D14_bit         _BIT_ACCESS(TXB0D1,4)
// TXB0D1<TXB0D15>
extern volatile __bit                   TXB0D15             __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 TXB0D15_bit         _BIT_ACCESS(TXB0D1,5)
// TXB0D1<TXB0D16>
extern volatile __bit                   TXB0D16             __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 TXB0D16_bit         _BIT_ACCESS(TXB0D1,6)
// TXB0D1<TXB0D17>
extern volatile __bit                   TXB0D17             __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 TXB0D17_bit         _BIT_ACCESS(TXB0D1,7)
// TXB0D2<TXB0D20>
extern volatile __bit                   TXB0D20             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 TXB0D20_bit         _BIT_ACCESS(TXB0D2,0)
// TXB0D2<TXB0D21>
extern volatile __bit                   TXB0D21             __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 TXB0D21_bit         _BIT_ACCESS(TXB0D2,1)
// TXB0D2<TXB0D22>
extern volatile __bit                   TXB0D22             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 TXB0D22_bit         _BIT_ACCESS(TXB0D2,2)
// TXB0D2<TXB0D23>
extern volatile __bit                   TXB0D23             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 TXB0D23_bit         _BIT_ACCESS(TXB0D2,3)
// TXB0D2<TXB0D24>
extern volatile __bit                   TXB0D24             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 TXB0D24_bit         _BIT_ACCESS(TXB0D2,4)
// TXB0D2<TXB0D25>
extern volatile __bit                   TXB0D25             __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 TXB0D25_bit         _BIT_ACCESS(TXB0D2,5)
// TXB0D2<TXB0D26>
extern volatile __bit                   TXB0D26             __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 TXB0D26_bit         _BIT_ACCESS(TXB0D2,6)
// TXB0D2<TXB0D27>
extern volatile __bit                   TXB0D27             __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 TXB0D27_bit         _BIT_ACCESS(TXB0D2,7)
// TXB0D3<TXB0D30>
extern volatile __bit                   TXB0D30             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 TXB0D30_bit         _BIT_ACCESS(TXB0D3,0)
// TXB0D3<TXB0D31>
extern volatile __bit                   TXB0D31             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 TXB0D31_bit         _BIT_ACCESS(TXB0D3,1)
// TXB0D3<TXB0D32>
extern volatile __bit                   TXB0D32             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 TXB0D32_bit         _BIT_ACCESS(TXB0D3,2)
// TXB0D3<TXB0D33>
extern volatile __bit                   TXB0D33             __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 TXB0D33_bit         _BIT_ACCESS(TXB0D3,3)
// TXB0D3<TXB0D34>
extern volatile __bit                   TXB0D34             __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 TXB0D34_bit         _BIT_ACCESS(TXB0D3,4)
// TXB0D3<TXB0D35>
extern volatile __bit                   TXB0D35             __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 TXB0D35_bit         _BIT_ACCESS(TXB0D3,5)
// TXB0D3<TXB0D36>
extern volatile __bit                   TXB0D36             __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 TXB0D36_bit         _BIT_ACCESS(TXB0D3,6)
// TXB0D3<TXB0D37>
extern volatile __bit                   TXB0D37             __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 TXB0D37_bit         _BIT_ACCESS(TXB0D3,7)
// TXB0D4<TXB0D40>
extern volatile __bit                   TXB0D40             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 TXB0D40_bit         _BIT_ACCESS(TXB0D4,0)
// TXB0D4<TXB0D41>
extern volatile __bit                   TXB0D41             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 TXB0D41_bit         _BIT_ACCESS(TXB0D4,1)
// TXB0D4<TXB0D42>
extern volatile __bit                   TXB0D42             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 TXB0D42_bit         _BIT_ACCESS(TXB0D4,2)
// TXB0D4<TXB0D43>
extern volatile __bit                   TXB0D43             __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 TXB0D43_bit         _BIT_ACCESS(TXB0D4,3)
// TXB0D4<TXB0D44>
extern volatile __bit                   TXB0D44             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 TXB0D44_bit         _BIT_ACCESS(TXB0D4,4)
// TXB0D4<TXB0D45>
extern volatile __bit                   TXB0D45             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 TXB0D45_bit         _BIT_ACCESS(TXB0D4,5)
// TXB0D4<TXB0D46>
extern volatile __bit                   TXB0D46             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 TXB0D46_bit         _BIT_ACCESS(TXB0D4,6)
// TXB0D4<TXB0D47>
extern volatile __bit                   TXB0D47             __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 TXB0D47_bit         _BIT_ACCESS(TXB0D4,7)
// TXB0D5<TXB0D50>
extern volatile __bit                   TXB0D50             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 TXB0D50_bit         _BIT_ACCESS(TXB0D5,0)
// TXB0D5<TXB0D51>
extern volatile __bit                   TXB0D51             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 TXB0D51_bit         _BIT_ACCESS(TXB0D5,1)
// TXB0D5<TXB0D52>
extern volatile __bit                   TXB0D52             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 TXB0D52_bit         _BIT_ACCESS(TXB0D5,2)
// TXB0D5<TXB0D53>
extern volatile __bit                   TXB0D53             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 TXB0D53_bit         _BIT_ACCESS(TXB0D5,3)
// TXB0D5<TXB0D54>
extern volatile __bit                   TXB0D54             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 TXB0D54_bit         _BIT_ACCESS(TXB0D5,4)
// TXB0D5<TXB0D55>
extern volatile __bit                   TXB0D55             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 TXB0D55_bit         _BIT_ACCESS(TXB0D5,5)
// TXB0D5<TXB0D56>
extern volatile __bit                   TXB0D56             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 TXB0D56_bit         _BIT_ACCESS(TXB0D5,6)
// TXB0D5<TXB0D57>
extern volatile __bit                   TXB0D57             __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 TXB0D57_bit         _BIT_ACCESS(TXB0D5,7)
// TXB0D6<TXB0D60>
extern volatile __bit                   TXB0D60             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 TXB0D60_bit         _BIT_ACCESS(TXB0D6,0)
// TXB0D6<TXB0D61>
extern volatile __bit                   TXB0D61             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 TXB0D61_bit         _BIT_ACCESS(TXB0D6,1)
// TXB0D6<TXB0D62>
extern volatile __bit                   TXB0D62             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 TXB0D62_bit         _BIT_ACCESS(TXB0D6,2)
// TXB0D6<TXB0D63>
extern volatile __bit                   TXB0D63             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 TXB0D63_bit         _BIT_ACCESS(TXB0D6,3)
// TXB0D6<TXB0D64>
extern volatile __bit                   TXB0D64             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 TXB0D64_bit         _BIT_ACCESS(TXB0D6,4)
// TXB0D6<TXB0D65>
extern volatile __bit                   TXB0D65             __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 TXB0D65_bit         _BIT_ACCESS(TXB0D6,5)
// TXB0D6<TXB0D66>
extern volatile __bit                   TXB0D66             __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 TXB0D66_bit         _BIT_ACCESS(TXB0D6,6)
// TXB0D6<TXB0D67>
extern volatile __bit                   TXB0D67             __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 TXB0D67_bit         _BIT_ACCESS(TXB0D6,7)
// TXB0D7<TXB0D70>
extern volatile __bit                   TXB0D70             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 TXB0D70_bit         _BIT_ACCESS(TXB0D7,0)
// TXB0D7<TXB0D71>
extern volatile __bit                   TXB0D71             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 TXB0D71_bit         _BIT_ACCESS(TXB0D7,1)
// TXB0D7<TXB0D72>
extern volatile __bit                   TXB0D72             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 TXB0D72_bit         _BIT_ACCESS(TXB0D7,2)
// TXB0D7<TXB0D73>
extern volatile __bit                   TXB0D73             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 TXB0D73_bit         _BIT_ACCESS(TXB0D7,3)
// TXB0D7<TXB0D74>
extern volatile __bit                   TXB0D74             __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXB0D74_bit         _BIT_ACCESS(TXB0D7,4)
// TXB0D7<TXB0D75>
extern volatile __bit                   TXB0D75             __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 TXB0D75_bit         _BIT_ACCESS(TXB0D7,5)
// TXB0D7<TXB0D76>
extern volatile __bit                   TXB0D76             __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 TXB0D76_bit         _BIT_ACCESS(TXB0D7,6)
// TXB0D7<TXB0D77>
extern volatile __bit                   TXB0D77             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 TXB0D77_bit         _BIT_ACCESS(TXB0D7,7)
// TXB0DLC<TXB0DLC0>
extern volatile __bit                   TXB0DLC0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 TXB0DLC0_bit        _BIT_ACCESS(TXB0DLC,0)
// TXB0DLC<TXB0DLC1>
extern volatile __bit                   TXB0DLC1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 TXB0DLC1_bit        _BIT_ACCESS(TXB0DLC,1)
// TXB0DLC<TXB0DLC2>
extern volatile __bit                   TXB0DLC2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 TXB0DLC2_bit        _BIT_ACCESS(TXB0DLC,2)
// TXB0DLC<TXB0DLC3>
extern volatile __bit                   TXB0DLC3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 TXB0DLC3_bit        _BIT_ACCESS(TXB0DLC,3)
// TXB0EIDL<TXB0EID0>
extern volatile __bit                   TXB0EID0            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 TXB0EID0_bit        _BIT_ACCESS(TXB0EIDL,0)
// TXB0EIDL<TXB0EID1>
extern volatile __bit                   TXB0EID1            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 TXB0EID1_bit        _BIT_ACCESS(TXB0EIDL,1)
// TXB0EIDH<TXB0EID10>
extern volatile __bit                   TXB0EID10           __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 TXB0EID10_bit       _BIT_ACCESS(TXB0EIDH,2)
// TXB0EIDH<TXB0EID11>
extern volatile __bit                   TXB0EID11           __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 TXB0EID11_bit       _BIT_ACCESS(TXB0EIDH,3)
// TXB0EIDH<TXB0EID12>
extern volatile __bit                   TXB0EID12           __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 TXB0EID12_bit       _BIT_ACCESS(TXB0EIDH,4)
// TXB0EIDH<TXB0EID13>
extern volatile __bit                   TXB0EID13           __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 TXB0EID13_bit       _BIT_ACCESS(TXB0EIDH,5)
// TXB0EIDH<TXB0EID14>
extern volatile __bit                   TXB0EID14           __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 TXB0EID14_bit       _BIT_ACCESS(TXB0EIDH,6)
// TXB0EIDH<TXB0EID15>
extern volatile __bit                   TXB0EID15           __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 TXB0EID15_bit       _BIT_ACCESS(TXB0EIDH,7)
// TXB0SIDL<TXB0EID16>
extern volatile __bit                   TXB0EID16           __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 TXB0EID16_bit       _BIT_ACCESS(TXB0SIDL,0)
// TXB0SIDL<TXB0EID17>
extern volatile __bit                   TXB0EID17           __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 TXB0EID17_bit       _BIT_ACCESS(TXB0SIDL,1)
// TXB0EIDL<TXB0EID2>
extern volatile __bit                   TXB0EID2            __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 TXB0EID2_bit        _BIT_ACCESS(TXB0EIDL,2)
// TXB0EIDL<TXB0EID3>
extern volatile __bit                   TXB0EID3            __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 TXB0EID3_bit        _BIT_ACCESS(TXB0EIDL,3)
// TXB0EIDL<TXB0EID4>
extern volatile __bit                   TXB0EID4            __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 TXB0EID4_bit        _BIT_ACCESS(TXB0EIDL,4)
// TXB0EIDL<TXB0EID5>
extern volatile __bit                   TXB0EID5            __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 TXB0EID5_bit        _BIT_ACCESS(TXB0EIDL,5)
// TXB0EIDL<TXB0EID6>
extern volatile __bit                   TXB0EID6            __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 TXB0EID6_bit        _BIT_ACCESS(TXB0EIDL,6)
// TXB0EIDL<TXB0EID7>
extern volatile __bit                   TXB0EID7            __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 TXB0EID7_bit        _BIT_ACCESS(TXB0EIDL,7)
// TXB0EIDH<TXB0EID8>
extern volatile __bit                   TXB0EID8            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 TXB0EID8_bit        _BIT_ACCESS(TXB0EIDH,0)
// TXB0EIDH<TXB0EID9>
extern volatile __bit                   TXB0EID9            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 TXB0EID9_bit        _BIT_ACCESS(TXB0EIDH,1)
// TXB0CON<TXB0ERR>
extern volatile __bit                   TXB0ERR             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 TXB0ERR_bit         _BIT_ACCESS(TXB0CON,4)
// TXB0SIDL<TXB0EXIDE>
extern volatile __bit                   TXB0EXIDE           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 TXB0EXIDE_bit       _BIT_ACCESS(TXB0SIDL,3)
// PIR5<TXB0IF>
extern volatile __bit                   TXB0IF              __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 TXB0IF_bit          _BIT_ACCESS(PIR5,2)
// IPR5<TXB0IP>
extern volatile __bit                   TXB0IP              __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 TXB0IP_bit          _BIT_ACCESS(IPR5,2)
// TXB0CON<TXB0LARB>
extern volatile __bit                   TXB0LARB            __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 TXB0LARB_bit        _BIT_ACCESS(TXB0CON,5)
// TXB0CON<TXB0PRI0>
extern volatile __bit                   TXB0PRI0            __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 TXB0PRI0_bit        _BIT_ACCESS(TXB0CON,0)
// TXB0CON<TXB0PRI1>
extern volatile __bit                   TXB0PRI1            __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 TXB0PRI1_bit        _BIT_ACCESS(TXB0CON,1)
// TXB0CON<TXB0REQ>
extern volatile __bit                   TXB0REQ             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 TXB0REQ_bit         _BIT_ACCESS(TXB0CON,3)
// TXB0DLC<TXB0RTR>
extern volatile __bit                   TXB0RTR             __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 TXB0RTR_bit         _BIT_ACCESS(TXB0DLC,6)
// TXB0SIDL<TXB0SID0>
extern volatile __bit                   TXB0SID0            __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 TXB0SID0_bit        _BIT_ACCESS(TXB0SIDL,5)
// TXB0SIDL<TXB0SID1>
extern volatile __bit                   TXB0SID1            __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 TXB0SID1_bit        _BIT_ACCESS(TXB0SIDL,6)
// TXB0SIDH<TXB0SID10>
extern volatile __bit                   TXB0SID10           __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 TXB0SID10_bit       _BIT_ACCESS(TXB0SIDH,7)
// TXB0SIDL<TXB0SID2>
extern volatile __bit                   TXB0SID2            __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 TXB0SID2_bit        _BIT_ACCESS(TXB0SIDL,7)
// TXB0SIDH<TXB0SID3>
extern volatile __bit                   TXB0SID3            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 TXB0SID3_bit        _BIT_ACCESS(TXB0SIDH,0)
// TXB0SIDH<TXB0SID4>
extern volatile __bit                   TXB0SID4            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 TXB0SID4_bit        _BIT_ACCESS(TXB0SIDH,1)
// TXB0SIDH<TXB0SID5>
extern volatile __bit                   TXB0SID5            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 TXB0SID5_bit        _BIT_ACCESS(TXB0SIDH,2)
// TXB0SIDH<TXB0SID6>
extern volatile __bit                   TXB0SID6            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 TXB0SID6_bit        _BIT_ACCESS(TXB0SIDH,3)
// TXB0SIDH<TXB0SID7>
extern volatile __bit                   TXB0SID7            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 TXB0SID7_bit        _BIT_ACCESS(TXB0SIDH,4)
// TXB0SIDH<TXB0SID8>
extern volatile __bit                   TXB0SID8            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXB0SID8_bit        _BIT_ACCESS(TXB0SIDH,5)
// TXB0SIDH<TXB0SID9>
extern volatile __bit                   TXB0SID9            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 TXB0SID9_bit        _BIT_ACCESS(TXB0SIDH,6)
// TXB1CON<TXB1ABT>
extern volatile __bit                   TXB1ABT             __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 TXB1ABT_bit         _BIT_ACCESS(TXB1CON,6)
// TXB1D0<TXB1D00>
extern volatile __bit                   TXB1D00             __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 TXB1D00_bit         _BIT_ACCESS(TXB1D0,0)
// TXB1D0<TXB1D01>
extern volatile __bit                   TXB1D01             __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 TXB1D01_bit         _BIT_ACCESS(TXB1D0,1)
// TXB1D0<TXB1D02>
extern volatile __bit                   TXB1D02             __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 TXB1D02_bit         _BIT_ACCESS(TXB1D0,2)
// TXB1D0<TXB1D03>
extern volatile __bit                   TXB1D03             __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 TXB1D03_bit         _BIT_ACCESS(TXB1D0,3)
// TXB1D0<TXB1D04>
extern volatile __bit                   TXB1D04             __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 TXB1D04_bit         _BIT_ACCESS(TXB1D0,4)
// TXB1D0<TXB1D05>
extern volatile __bit                   TXB1D05             __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 TXB1D05_bit         _BIT_ACCESS(TXB1D0,5)
// TXB1D0<TXB1D06>
extern volatile __bit                   TXB1D06             __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 TXB1D06_bit         _BIT_ACCESS(TXB1D0,6)
// TXB1D0<TXB1D07>
extern volatile __bit                   TXB1D07             __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 TXB1D07_bit         _BIT_ACCESS(TXB1D0,7)
// TXB1D1<TXB1D10>
extern volatile __bit                   TXB1D10             __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 TXB1D10_bit         _BIT_ACCESS(TXB1D1,0)
// TXB1D1<TXB1D11>
extern volatile __bit                   TXB1D11             __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 TXB1D11_bit         _BIT_ACCESS(TXB1D1,1)
// TXB1D1<TXB1D12>
extern volatile __bit                   TXB1D12             __at(0x78BA);	// @ (0xF17 * 8 + 2)
