MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K80/mcu.h
extern volatile __bit                   TXB2D31             __at(0x7849);	// @ (0xF09 * 8 + 1)
#define                                 TXB2D31_bit         _BIT_ACCESS(TXB2D3,1)
// TXB2D3<TXB2D32>
extern volatile __bit                   TXB2D32             __at(0x784A);	// @ (0xF09 * 8 + 2)
#define                                 TXB2D32_bit         _BIT_ACCESS(TXB2D3,2)
// TXB2D3<TXB2D33>
extern volatile __bit                   TXB2D33             __at(0x784B);	// @ (0xF09 * 8 + 3)
#define                                 TXB2D33_bit         _BIT_ACCESS(TXB2D3,3)
// TXB2D3<TXB2D34>
extern volatile __bit                   TXB2D34             __at(0x784C);	// @ (0xF09 * 8 + 4)
#define                                 TXB2D34_bit         _BIT_ACCESS(TXB2D3,4)
// TXB2D3<TXB2D35>
extern volatile __bit                   TXB2D35             __at(0x784D);	// @ (0xF09 * 8 + 5)
#define                                 TXB2D35_bit         _BIT_ACCESS(TXB2D3,5)
// TXB2D3<TXB2D36>
extern volatile __bit                   TXB2D36             __at(0x784E);	// @ (0xF09 * 8 + 6)
#define                                 TXB2D36_bit         _BIT_ACCESS(TXB2D3,6)
// TXB2D3<TXB2D37>
extern volatile __bit                   TXB2D37             __at(0x784F);	// @ (0xF09 * 8 + 7)
#define                                 TXB2D37_bit         _BIT_ACCESS(TXB2D3,7)
// TXB2D4<TXB2D40>
extern volatile __bit                   TXB2D40             __at(0x7850);	// @ (0xF0A * 8 + 0)
#define                                 TXB2D40_bit         _BIT_ACCESS(TXB2D4,0)
// TXB2D4<TXB2D41>
extern volatile __bit                   TXB2D41             __at(0x7851);	// @ (0xF0A * 8 + 1)
#define                                 TXB2D41_bit         _BIT_ACCESS(TXB2D4,1)
// TXB2D4<TXB2D42>
extern volatile __bit                   TXB2D42             __at(0x7852);	// @ (0xF0A * 8 + 2)
#define                                 TXB2D42_bit         _BIT_ACCESS(TXB2D4,2)
// TXB2D4<TXB2D43>
extern volatile __bit                   TXB2D43             __at(0x7853);	// @ (0xF0A * 8 + 3)
#define                                 TXB2D43_bit         _BIT_ACCESS(TXB2D4,3)
// TXB2D4<TXB2D44>
extern volatile __bit                   TXB2D44             __at(0x7854);	// @ (0xF0A * 8 + 4)
#define                                 TXB2D44_bit         _BIT_ACCESS(TXB2D4,4)
// TXB2D4<TXB2D45>
extern volatile __bit                   TXB2D45             __at(0x7855);	// @ (0xF0A * 8 + 5)
#define                                 TXB2D45_bit         _BIT_ACCESS(TXB2D4,5)
// TXB2D4<TXB2D46>
extern volatile __bit                   TXB2D46             __at(0x7856);	// @ (0xF0A * 8 + 6)
#define                                 TXB2D46_bit         _BIT_ACCESS(TXB2D4,6)
// TXB2D4<TXB2D47>
extern volatile __bit                   TXB2D47             __at(0x7857);	// @ (0xF0A * 8 + 7)
#define                                 TXB2D47_bit         _BIT_ACCESS(TXB2D4,7)
// TXB2D5<TXB2D50>
extern volatile __bit                   TXB2D50             __at(0x7858);	// @ (0xF0B * 8 + 0)
#define                                 TXB2D50_bit         _BIT_ACCESS(TXB2D5,0)
// TXB2D5<TXB2D51>
extern volatile __bit                   TXB2D51             __at(0x7859);	// @ (0xF0B * 8 + 1)
#define                                 TXB2D51_bit         _BIT_ACCESS(TXB2D5,1)
// TXB2D5<TXB2D52>
extern volatile __bit                   TXB2D52             __at(0x785A);	// @ (0xF0B * 8 + 2)
#define                                 TXB2D52_bit         _BIT_ACCESS(TXB2D5,2)
// TXB2D5<TXB2D53>
extern volatile __bit                   TXB2D53             __at(0x785B);	// @ (0xF0B * 8 + 3)
#define                                 TXB2D53_bit         _BIT_ACCESS(TXB2D5,3)
// TXB2D5<TXB2D54>
extern volatile __bit                   TXB2D54             __at(0x785C);	// @ (0xF0B * 8 + 4)
#define                                 TXB2D54_bit         _BIT_ACCESS(TXB2D5,4)
// TXB2D5<TXB2D55>
extern volatile __bit                   TXB2D55             __at(0x785D);	// @ (0xF0B * 8 + 5)
#define                                 TXB2D55_bit         _BIT_ACCESS(TXB2D5,5)
// TXB2D5<TXB2D56>
extern volatile __bit                   TXB2D56             __at(0x785E);	// @ (0xF0B * 8 + 6)
#define                                 TXB2D56_bit         _BIT_ACCESS(TXB2D5,6)
// TXB2D5<TXB2D57>
extern volatile __bit                   TXB2D57             __at(0x785F);	// @ (0xF0B * 8 + 7)
#define                                 TXB2D57_bit         _BIT_ACCESS(TXB2D5,7)
// TXB2D6<TXB2D60>
extern volatile __bit                   TXB2D60             __at(0x7860);	// @ (0xF0C * 8 + 0)
#define                                 TXB2D60_bit         _BIT_ACCESS(TXB2D6,0)
// TXB2D6<TXB2D61>
extern volatile __bit                   TXB2D61             __at(0x7861);	// @ (0xF0C * 8 + 1)
#define                                 TXB2D61_bit         _BIT_ACCESS(TXB2D6,1)
// TXB2D6<TXB2D62>
extern volatile __bit                   TXB2D62             __at(0x7862);	// @ (0xF0C * 8 + 2)
#define                                 TXB2D62_bit         _BIT_ACCESS(TXB2D6,2)
// TXB2D6<TXB2D63>
extern volatile __bit                   TXB2D63             __at(0x7863);	// @ (0xF0C * 8 + 3)
#define                                 TXB2D63_bit         _BIT_ACCESS(TXB2D6,3)
// TXB2D6<TXB2D64>
extern volatile __bit                   TXB2D64             __at(0x7864);	// @ (0xF0C * 8 + 4)
#define                                 TXB2D64_bit         _BIT_ACCESS(TXB2D6,4)
// TXB2D6<TXB2D65>
extern volatile __bit                   TXB2D65             __at(0x7865);	// @ (0xF0C * 8 + 5)
#define                                 TXB2D65_bit         _BIT_ACCESS(TXB2D6,5)
// TXB2D6<TXB2D66>
extern volatile __bit                   TXB2D66             __at(0x7866);	// @ (0xF0C * 8 + 6)
#define                                 TXB2D66_bit         _BIT_ACCESS(TXB2D6,6)
// TXB2D6<TXB2D67>
extern volatile __bit                   TXB2D67             __at(0x7867);	// @ (0xF0C * 8 + 7)
#define                                 TXB2D67_bit         _BIT_ACCESS(TXB2D6,7)
// TXB2D7<TXB2D70>
extern volatile __bit                   TXB2D70             __at(0x7868);	// @ (0xF0D * 8 + 0)
#define                                 TXB2D70_bit         _BIT_ACCESS(TXB2D7,0)
// TXB2D7<TXB2D71>
extern volatile __bit                   TXB2D71             __at(0x7869);	// @ (0xF0D * 8 + 1)
#define                                 TXB2D71_bit         _BIT_ACCESS(TXB2D7,1)
// TXB2D7<TXB2D72>
extern volatile __bit                   TXB2D72             __at(0x786A);	// @ (0xF0D * 8 + 2)
#define                                 TXB2D72_bit         _BIT_ACCESS(TXB2D7,2)
// TXB2D7<TXB2D73>
extern volatile __bit                   TXB2D73             __at(0x786B);	// @ (0xF0D * 8 + 3)
#define                                 TXB2D73_bit         _BIT_ACCESS(TXB2D7,3)
// TXB2D7<TXB2D74>
extern volatile __bit                   TXB2D74             __at(0x786C);	// @ (0xF0D * 8 + 4)
#define                                 TXB2D74_bit         _BIT_ACCESS(TXB2D7,4)
// TXB2D7<TXB2D75>
extern volatile __bit                   TXB2D75             __at(0x786D);	// @ (0xF0D * 8 + 5)
#define                                 TXB2D75_bit         _BIT_ACCESS(TXB2D7,5)
// TXB2D7<TXB2D76>
extern volatile __bit                   TXB2D76             __at(0x786E);	// @ (0xF0D * 8 + 6)
#define                                 TXB2D76_bit         _BIT_ACCESS(TXB2D7,6)
// TXB2D7<TXB2D77>
extern volatile __bit                   TXB2D77             __at(0x786F);	// @ (0xF0D * 8 + 7)
#define                                 TXB2D77_bit         _BIT_ACCESS(TXB2D7,7)
// TXB2DLC<TXB2DLC0>
extern volatile __bit                   TXB2DLC0            __at(0x7828);	// @ (0xF05 * 8 + 0)
#define                                 TXB2DLC0_bit        _BIT_ACCESS(TXB2DLC,0)
// TXB2DLC<TXB2DLC1>
extern volatile __bit                   TXB2DLC1            __at(0x7829);	// @ (0xF05 * 8 + 1)
#define                                 TXB2DLC1_bit        _BIT_ACCESS(TXB2DLC,1)
// TXB2DLC<TXB2DLC2>
extern volatile __bit                   TXB2DLC2            __at(0x782A);	// @ (0xF05 * 8 + 2)
#define                                 TXB2DLC2_bit        _BIT_ACCESS(TXB2DLC,2)
// TXB2DLC<TXB2DLC3>
extern volatile __bit                   TXB2DLC3            __at(0x782B);	// @ (0xF05 * 8 + 3)
#define                                 TXB2DLC3_bit        _BIT_ACCESS(TXB2DLC,3)
// TXB2EIDL<TXB2EID0>
extern volatile __bit                   TXB2EID0            __at(0x7820);	// @ (0xF04 * 8 + 0)
#define                                 TXB2EID0_bit        _BIT_ACCESS(TXB2EIDL,0)
// TXB2EIDL<TXB2EID1>
extern volatile __bit                   TXB2EID1            __at(0x7821);	// @ (0xF04 * 8 + 1)
#define                                 TXB2EID1_bit        _BIT_ACCESS(TXB2EIDL,1)
// TXB2EIDH<TXB2EID10>
extern volatile __bit                   TXB2EID10           __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 TXB2EID10_bit       _BIT_ACCESS(TXB2EIDH,2)
// TXB2EIDH<TXB2EID11>
extern volatile __bit                   TXB2EID11           __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 TXB2EID11_bit       _BIT_ACCESS(TXB2EIDH,3)
// TXB2EIDH<TXB2EID12>
extern volatile __bit                   TXB2EID12           __at(0x781C);	// @ (0xF03 * 8 + 4)
#define                                 TXB2EID12_bit       _BIT_ACCESS(TXB2EIDH,4)
// TXB2EIDH<TXB2EID13>
extern volatile __bit                   TXB2EID13           __at(0x781D);	// @ (0xF03 * 8 + 5)
#define                                 TXB2EID13_bit       _BIT_ACCESS(TXB2EIDH,5)
// TXB2EIDH<TXB2EID14>
extern volatile __bit                   TXB2EID14           __at(0x781E);	// @ (0xF03 * 8 + 6)
#define                                 TXB2EID14_bit       _BIT_ACCESS(TXB2EIDH,6)
// TXB2EIDH<TXB2EID15>
extern volatile __bit                   TXB2EID15           __at(0x781F);	// @ (0xF03 * 8 + 7)
#define                                 TXB2EID15_bit       _BIT_ACCESS(TXB2EIDH,7)
// TXB2SIDL<TXB2EID16>
extern volatile __bit                   TXB2EID16           __at(0x7810);	// @ (0xF02 * 8 + 0)
#define                                 TXB2EID16_bit       _BIT_ACCESS(TXB2SIDL,0)
// TXB2SIDL<TXB2EID17>
extern volatile __bit                   TXB2EID17           __at(0x7811);	// @ (0xF02 * 8 + 1)
#define                                 TXB2EID17_bit       _BIT_ACCESS(TXB2SIDL,1)
// TXB2EIDL<TXB2EID2>
extern volatile __bit                   TXB2EID2            __at(0x7822);	// @ (0xF04 * 8 + 2)
#define                                 TXB2EID2_bit        _BIT_ACCESS(TXB2EIDL,2)
// TXB2EIDL<TXB2EID3>
extern volatile __bit                   TXB2EID3            __at(0x7823);	// @ (0xF04 * 8 + 3)
#define                                 TXB2EID3_bit        _BIT_ACCESS(TXB2EIDL,3)
// TXB2EIDL<TXB2EID4>
extern volatile __bit                   TXB2EID4            __at(0x7824);	// @ (0xF04 * 8 + 4)
#define                                 TXB2EID4_bit        _BIT_ACCESS(TXB2EIDL,4)
// TXB2EIDL<TXB2EID5>
extern volatile __bit                   TXB2EID5            __at(0x7825);	// @ (0xF04 * 8 + 5)
#define                                 TXB2EID5_bit        _BIT_ACCESS(TXB2EIDL,5)
// TXB2EIDL<TXB2EID6>
extern volatile __bit                   TXB2EID6            __at(0x7826);	// @ (0xF04 * 8 + 6)
#define                                 TXB2EID6_bit        _BIT_ACCESS(TXB2EIDL,6)
// TXB2EIDL<TXB2EID7>
extern volatile __bit                   TXB2EID7            __at(0x7827);	// @ (0xF04 * 8 + 7)
#define                                 TXB2EID7_bit        _BIT_ACCESS(TXB2EIDL,7)
// TXB2EIDH<TXB2EID8>
extern volatile __bit                   TXB2EID8            __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 TXB2EID8_bit        _BIT_ACCESS(TXB2EIDH,0)
// TXB2EIDH<TXB2EID9>
extern volatile __bit                   TXB2EID9            __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 TXB2EID9_bit        _BIT_ACCESS(TXB2EIDH,1)
// TXB2CON<TXB2ERR>
extern volatile __bit                   TXB2ERR             __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 TXB2ERR_bit         _BIT_ACCESS(TXB2CON,4)
// TXB2SIDL<TXB2EXIDE>
extern volatile __bit                   TXB2EXIDE           __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 TXB2EXIDE_bit       _BIT_ACCESS(TXB2SIDL,3)
// PIR5<TXB2IF>
extern volatile __bit                   TXB2IF              __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 TXB2IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<TXB2IP>
extern volatile __bit                   TXB2IP              __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 TXB2IP_bit          _BIT_ACCESS(IPR5,4)
// TXB2CON<TXB2LARB>
extern volatile __bit                   TXB2LARB            __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 TXB2LARB_bit        _BIT_ACCESS(TXB2CON,5)
// TXB2CON<TXB2PRI0>
extern volatile __bit                   TXB2PRI0            __at(0x7800);	// @ (0xF00 * 8 + 0)
#define                                 TXB2PRI0_bit        _BIT_ACCESS(TXB2CON,0)
// TXB2CON<TXB2PRI1>
extern volatile __bit                   TXB2PRI1            __at(0x7801);	// @ (0xF00 * 8 + 1)
#define                                 TXB2PRI1_bit        _BIT_ACCESS(TXB2CON,1)
// TXB2CON<TXB2REQ>
extern volatile __bit                   TXB2REQ             __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 TXB2REQ_bit         _BIT_ACCESS(TXB2CON,3)
// TXB2DLC<TXB2RTR>
extern volatile __bit                   TXB2RTR             __at(0x782E);	// @ (0xF05 * 8 + 6)
#define                                 TXB2RTR_bit         _BIT_ACCESS(TXB2DLC,6)
// TXB2SIDL<TXB2SID0>
extern volatile __bit                   TXB2SID0            __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 TXB2SID0_bit        _BIT_ACCESS(TXB2SIDL,5)
// TXB2SIDL<TXB2SID1>
extern volatile __bit                   TXB2SID1            __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 TXB2SID1_bit        _BIT_ACCESS(TXB2SIDL,6)
// TXB2SIDH<TXB2SID10>
extern volatile __bit                   TXB2SID10           __at(0x780F);	// @ (0xF01 * 8 + 7)
#define                                 TXB2SID10_bit       _BIT_ACCESS(TXB2SIDH,7)
// TXB2SIDL<TXB2SID2>
extern volatile __bit                   TXB2SID2            __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 TXB2SID2_bit        _BIT_ACCESS(TXB2SIDL,7)
// TXB2SIDH<TXB2SID3>
extern volatile __bit                   TXB2SID3            __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 TXB2SID3_bit        _BIT_ACCESS(TXB2SIDH,0)
// TXB2SIDH<TXB2SID4>
extern volatile __bit                   TXB2SID4            __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 TXB2SID4_bit        _BIT_ACCESS(TXB2SIDH,1)
// TXB2SIDH<TXB2SID5>
extern volatile __bit                   TXB2SID5            __at(0x780A);	// @ (0xF01 * 8 + 2)
#define                                 TXB2SID5_bit        _BIT_ACCESS(TXB2SIDH,2)
// TXB2SIDH<TXB2SID6>
extern volatile __bit                   TXB2SID6            __at(0x780B);	// @ (0xF01 * 8 + 3)
#define                                 TXB2SID6_bit        _BIT_ACCESS(TXB2SIDH,3)
// TXB2SIDH<TXB2SID7>
extern volatile __bit                   TXB2SID7            __at(0x780C);	// @ (0xF01 * 8 + 4)
#define                                 TXB2SID7_bit        _BIT_ACCESS(TXB2SIDH,4)
// TXB2SIDH<TXB2SID8>
extern volatile __bit                   TXB2SID8            __at(0x780D);	// @ (0xF01 * 8 + 5)
#define                                 TXB2SID8_bit        _BIT_ACCESS(TXB2SIDH,5)
// TXB2SIDH<TXB2SID9>
extern volatile __bit                   TXB2SID9            __at(0x780E);	// @ (0xF01 * 8 + 6)
#define                                 TXB2SID9_bit        _BIT_ACCESS(TXB2SIDH,6)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// COMSTAT<TXBO>
extern volatile __bit                   TXBO                __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 TXBO_bit            _BIT_ACCESS(COMSTAT,5)
// COMSTAT<TXBP>
extern volatile __bit                   TXBP                __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 TXBP_bit            _BIT_ACCESS(COMSTAT,4)
// PIE5<TXBnIE>
extern volatile __bit                   TXBnIE              __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 TXBnIE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<TXBnIF>
extern volatile __bit                   TXBnIF              __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 TXBnIF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<TXBnIP>
extern volatile __bit                   TXBnIP              __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 TXBnIP_bit          _BIT_ACCESS(IPR5,4)
// BAUDCON1<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUDCON2,4)
// TXSTA1<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TXD82>
extern volatile __bit                   TXD82               __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TXSTA2,0)
// TXSTA1<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA1,5)
// TXSTA2<TXEN2>
extern volatile __bit                   TXEN2               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 TXEN2_bit           _BIT_ACCESS(TXSTA2,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// COMSTAT<TXWARN>
extern volatile __bit                   TXWARN              __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 TXWARN_bit          _BIT_ACCESS(COMSTAT,2)
// ODCON<U1OD>
extern volatile __bit                   U1OD                __at(0x7C88);	// @ (0xF91 * 8 + 0)
#define                                 U1OD_bit            _BIT_ACCESS(ODCON,0)
// ODCON<U2OD>
extern volatile __bit                   U2OD                __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 U2OD_bit            _BIT_ACCESS(ODCON,1)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PMD0<UART1MD>
extern volatile __bit                   UART1MD             __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD0,1)
// PMD0<UART2MD>
extern volatile __bit                   UART2MD             __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD0,2)
// WDTCON<ULPEN>
extern volatile __bit                   ULPEN               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 ULPEN_bit           _BIT_ACCESS(WDTCON,2)
// WDTCON<ULPLVL>
extern volatile __bit                   ULPLVL              __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 ULPLVL_bit          _BIT_ACCESS(WDTCON,5)
// WDTCON<ULPSINK>
extern volatile __bit                   ULPSINK             __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 ULPSINK_bit         _BIT_ACCESS(WDTCON,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// ADCON1<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG11_bit          _BIT_ACCESS(ADCON1,5)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// ADCON1<VNCFG>
extern volatile __bit                   VNCFG               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 VNCFG_bit           _BIT_ACCESS(ADCON1,3)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(_PR2,4)  // Note: Changed by MikroE
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(_PR2,5)  // Note: Changed by MikroE
// BRGCON3<WAKDIS>
extern volatile __bit                   WAKDIS              __at(0x722F);	// @ (0xE45 * 8 + 7)
#define                                 WAKDIS_bit          _BIT_ACCESS(BRGCON3,7)
// BRGCON3<WAKFIL>
extern volatile __bit                   WAKFIL              __at(0x722E);	// @ (0xE45 * 8 + 6)
#define                                 WAKFIL_bit          _BIT_ACCESS(BRGCON3,6)
// PIE5<WAKIE>
extern volatile __bit                   WAKIE               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 WAKIE_bit           _BIT_ACCESS(PIE5,6)
// PIR5<WAKIF>
extern volatile __bit                   WAKIF               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 WAKIF_bit           _BIT_ACCESS(PIR5,6)
// IPR5<WAKIP>
extern volatile __bit                   WAKIP               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 WAKIP_bit           _BIT_ACCESS(IPR5,6)
// SSPCON1<WCOL>
extern volatile __bit                   WCOL                __at(0x7E37);	// @ (0xFC6 * 8 + 7)
